# Etude du Désabonnement d'un client à une Card credit.

- Importation des librairie

In [173]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split
from sklearn.svm import LinearSVC
sns.set()

- Chargement du Dataset

In [143]:
df = pd.read_csv('bank.csv', sep=';', na_values='Unknown')

In [144]:
df.head()

,CLIENTNUM,Attrition_Flag,Customer_Age,Gender,Dependent_count,Education_Level,Marital_Status,Income_Category,Card_Category,Months_on_book,...,Months_Inactive_12_mon,Contacts_Count_12_mon,Credit_Limit,Total_Revolving_Bal,Avg_Open_To_Buy,Total_Amt_Chng_Q4_Q1,Total_Trans_Amt,Total_Trans_Ct,Total_Ct_Chng_Q4_Q1,Avg_Utilization_Ratio
0,768805383,Existing Customer,45,M,3,High School,Married,$60K - $80K,Blue,39,...,1,3,12691.0,777,11914.0,1.335,1144,42,1.625,0.061
1,818770008,Existing Customer,49,F,5,Graduate,Single,Less than $40K,Blue,44,...,1,2,8256.0,864,7392.0,1.541,1291,33,3.714,0.105
2,713982108,Existing Customer,51,M,3,Graduate,Married,$80K - $120K,Blue,36,...,1,0,3418.0,0,3418.0,2.594,1887,20,2.333,0.000
3,769911858,Existing Customer,40,F,4,High School,NaN,Less than $40K,Blue,34,...,4,1,3313.0,2517,796.0,1.405,1171,20,2.333,0.760
4,709106358,Existing Customer,40,M,3,Uneducated,Married,$60K - $80K,Blue,21,...,1,0,4716.0,0,4716.0,2.175,816,28,2.500,0.000

- Calcule du nombre de données manquante par Colonne

In [145]:
df.isna().sum()

CLIENTNUM                      0
Attrition_Flag                 0
Customer_Age                   0
Gender                         0
Dependent_count                0
Education_Level             1519
Marital_Status               749
Income_Category             1112
Card_Category                  0
Months_on_book                 0
Total_Relationship_Count       0
Months_Inactive_12_mon         0
Contacts_Count_12_mon          0
Credit_Limit                   0
Total_Revolving_Bal            0
Avg_Open_To_Buy                0
Total_Amt_Chng_Q4_Q1           0
Total_Trans_Amt                0
Total_Trans_Ct                 0
Total_Ct_Chng_Q4_Q1            0
Avg_Utilization_Ratio          0
dtype: int64

- Traitement des valeurs manquante

In [146]:
#Copy du Dataset
data = df.copy()

In [147]:
#Suppression des données manquante de la colonne la 
data = data.drop(['CLIENTNUM','Education_Level','Income_Category'],axis=1)

In [148]:
#Suppression des données manquante de la colonne Marital_status par les lignes
data = data.dropna()

- Vérification de la suppression des données manquante

In [149]:
data.isna().sum()

Attrition_Flag              0
Customer_Age                0
Gender                      0
Dependent_count             0
Marital_Status              0
Card_Category               0
Months_on_book              0
Total_Relationship_Count    0
Months_Inactive_12_mon      0
Contacts_Count_12_mon       0
Credit_Limit                0
Total_Revolving_Bal         0
Avg_Open_To_Buy             0
Total_Amt_Chng_Q4_Q1        0
Total_Trans_Amt             0
Total_Trans_Ct              0
Total_Ct_Chng_Q4_Q1         0
Avg_Utilization_Ratio       0
dtype: int64

In [150]:
data.head()

,Attrition_Flag,Customer_Age,Gender,Dependent_count,Marital_Status,Card_Category,Months_on_book,Total_Relationship_Count,Months_Inactive_12_mon,Contacts_Count_12_mon,Credit_Limit,Total_Revolving_Bal,Avg_Open_To_Buy,Total_Amt_Chng_Q4_Q1,Total_Trans_Amt,Total_Trans_Ct,Total_Ct_Chng_Q4_Q1,Avg_Utilization_Ratio
0,Existing Customer,45,M,3,Married,Blue,39,5,1,3,12691.0,777,11914.0,1.335,1144,42,1.625,0.061
1,Existing Customer,49,F,5,Single,Blue,44,6,1,2,8256.0,864,7392.0,1.541,1291,33,3.714,0.105
2,Existing Customer,51,M,3,Married,Blue,36,4,1,0,3418.0,0,3418.0,2.594,1887,20,2.333,0.000
4,Existing Customer,40,M,3,Married,Blue,21,5,1,0,4716.0,0,4716.0,2.175,816,28,2.500,0.000
5,Existing Customer,44,M,2,Married,Blue,36,3,1,2,4010.0,1247,2763.0,1.376,1088,24,0.846,0.311

In [151]:
data['Card_Category'].value_counts()

Blue        8753
Silver       503
Gold         104
Platinum      18
Name: Card_Category, dtype: int64

- Encodage des variables qualitatives

In [152]:
df_quali_nom = data.select_dtypes(exclude=['int64','float64']).drop(['Card_Category','Attrition_Flag'],axis=1)
df_quanti = data.select_dtypes(exclude=object)
df_quali_nom

      Gender Marital_Status
0          M        Married
1          F         Single
2          M        Married
4          M        Married
5          M        Married
...      ...            ...
10121      F         Single
10122      M         Single
10123      M       Divorced
10124      F        Married
10126      F        Married

[9378 rows x 2 columns]

In [153]:
#Encodage des variables qualitive
df_quali_nom = pd.get_dummies(df_quali_nom)
data['Card_Category'] = data['Card_Category'].replace(['Blue','Silver','Gold','Platinum'],[3,2,1,0])
enc = LabelEncoder()
label_encoder = enc.fit(data['Attrition_Flag'])
data['Attrition_Flag'] = label_encoder.transform(data['Attrition_Flag'])

- Assemblage du Dataset

In [154]:
datas = pd.concat([df_quali_nom,data['Card_Category'],df_quanti],axis=1)

In [155]:
datas.head()

,Gender_F,Gender_M,Marital_Status_Divorced,Marital_Status_Married,Marital_Status_Single,Card_Category,Customer_Age,Dependent_count,Months_on_book,Total_Relationship_Count,Months_Inactive_12_mon,Contacts_Count_12_mon,Credit_Limit,Total_Revolving_Bal,Avg_Open_To_Buy,Total_Amt_Chng_Q4_Q1,Total_Trans_Amt,Total_Trans_Ct,Total_Ct_Chng_Q4_Q1,Avg_Utilization_Ratio
0,0,1,0,1,0,3,45,3,39,5,1,3,12691.0,777,11914.0,1.335,1144,42,1.625,0.061
1,1,0,0,0,1,3,49,5,44,6,1,2,8256.0,864,7392.0,1.541,1291,33,3.714,0.105
2,0,1,0,1,0,3,51,3,36,4,1,0,3418.0,0,3418.0,2.594,1887,20,2.333,0.000
4,0,1,0,1,0,3,40,3,21,5,1,0,4716.0,0,4716.0,2.175,816,28,2.500,0.000
5,0,1,0,1,0,3,44,2,36,3,1,2,4010.0,1247,2763.0,1.376,1088,24,0.846,0.311

- Creation des variable pour l'entrainement du modèle

In [166]:
X = datas.values
y = data['Attrition_Flag'].values

In [171]:
X_train,X_test,y_train,y_test =train_test_split(X,y,test_size=.3, random_state=5)

In [172]:
print(X_train.shape)
print(X_test.shape)
print(y_train.shape)
print(y_test.shape)

(6564, 20)
(2814, 20)
(6564,)
(2814,)

- Modelisation

In [174]:
model = LinearSVC()

model.fit(X_train,y_train)

c:\users\admin\appdata\local\programs\python\python39\lib\site-packages\sklearn\svm\_base.py:985: ConvergenceWarning: Liblinear failed to converge, increase the number of iterations.
  warnings.warn("Liblinear failed to converge, increase "

LinearSVC()

In [175]:
train_score = model.score(X_train, y_train)
print(f'Score sur le données d\entrainement : {train_score}')

Score sur le données d\entrainement : 0.8572516758074344

In [176]:
test_score = model.score(X_test, y_test)
print(f'Score sur les données de test : {test_score}')

Score sur les données de test : 0.8521677327647477